Портал_EDT/src/InformationRegisters/Аук_ИсторияСтатусовАукционов/Аук_ИсторияСтатусовАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ИсторияСтатусовАукционов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.Аук_СтатусыАукционов</types>
    </type>
  </resources>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/InformationRegisters/Аук_ИсторияСтатусовАукционов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ИсторияСтатусовАукционов");
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ИсторияСтатусовАукционов");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеАукциона(пАукцион, пДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион КАК Аукцион,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Статус КАК Статус,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Этап КАК Этап
	|ИЗ
	|	РегистрСведений.Аук_ИсторияСтатусовАукционов.СрезПоследних(&НаДату, Аукцион = &Аукцион) КАК Аук_ИсторияСтатусовАукционовСрезПоследних";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НаДату",		пДата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции	

#КонецОбласти
